; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_3 ?v8 - type_3 ?v2 - type_2)
 	      (pred_4 ?v5 - object ?v2 - type_2)
	      (pred_1 ?v8 - type_3 ?v1 - type_1)
	      (pred_2 ?v8 - type_3 ?v5 - object ?v1 - type_1))

   (:action op_1
       :parameters  (?v8 - type_3 ?v3 ?v7 - type_2)
       :precondition (and  (pred_3 ?v8 ?v3))
       :effect (and  (pred_3 ?v8 ?v7)
		     (not (pred_3 ?v8 ?v3))))

   (:action op_3
       :parameters (?v8 - type_3 ?v4 - object ?v6 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_4 ?v4 ?v6) (pred_3 ?v8 ?v6) (pred_1 ?v8 ?v1))
       :effect (and (pred_2 ?v8 ?v4 ?v1)
		    (not (pred_4 ?v4 ?v6)) 
		    (not (pred_1 ?v8 ?v1))))

   (:action op_2
       :parameters (?v8 - type_3 ?v4 - object ?v6 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_2 ?v8 ?v4 ?v1) (pred_3 ?v8 ?v6))
       :effect (and (pred_4 ?v4 ?v6)
		    (pred_1 ?v8 ?v1)
		    (not (pred_2 ?v8 ?v4 ?v1)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_08 - type_3
obj_03 obj_02 - type_1
obj_09 obj_04 obj_07 obj_06 - type_2
obj_05 obj_01 obj_10 - object)
(:init
(pred_3 obj_08 obj_06)
(pred_1 obj_08 obj_03)
(pred_1 obj_08 obj_02)
(pred_4 obj_05 obj_06)
(pred_4 obj_01 obj_09)
(pred_4 obj_10 obj_09)
)
(:goal
(and
(pred_4 obj_05 obj_06)
(pred_4 obj_01 obj_07)
(pred_4 obj_10 obj_07)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_08 ?b obj_02))))
)
)

; plan
1. (op_1 obj_08 obj_06 obj_09)
   deleted: (pred_3 obj_08 obj_06)
   added: (pred_3 obj_08 obj_09)
   goals met: 1 of 3
2. (op_3 obj_08 obj_01 obj_09 obj_03)
   deleted: (pred_4 obj_01 obj_09) (pred_1 obj_08 obj_03)
   added: (pred_2 obj_08 obj_01 obj_03)
   goals met: 1 of 3
3. (op_1 obj_08 obj_09 obj_07)
   deleted: (pred_3 obj_08 obj_09)
   added: (pred_3 obj_08 obj_07)
   goals met: 1 of 3
4. (op_2 obj_08 obj_01 obj_07 obj_03)
   deleted: (pred_2 obj_08 obj_01 obj_03)
   added: (pred_4 obj_01 obj_07) (pred_1 obj_08 obj_03)
   goals met: 2 of 3
5. (op_1 obj_08 obj_07 obj_09)
   deleted: (pred_3 obj_08 obj_07)
   added: (pred_3 obj_08 obj_09)
   goals met: 2 of 3
6. (op_3 obj_08 obj_10 obj_09 obj_03)
   deleted: (pred_4 obj_10 obj_09) (pred_1 obj_08 obj_03)
   added: (pred_2 obj_08 obj_10 obj_03)
   goals met: 2 of 3
7. (op_1 obj_08 obj_09 obj_07)
   deleted: (pred_3 obj_08 obj_09)
   added: (pred_3 obj_08 obj_07)
   goals met: 2 of 3
8. (op_2 obj_08 obj_10 obj_07 obj_03)
   deleted: (pred_2 obj_08 obj_10 obj_03)
   added: (pred_4 obj_10 obj_07) (pred_1 obj_08 obj_03)
   goals met: 3 of 3
